#!/bin/bash

RED='\033[0;31m'
GREEN='\033[0;32m'
YELLOW='\033[0;33m'
NC='\033[0m'

echo "██████╗░███████╗░█████╗░██████╗░░░░░░░░█████╗░░██████╗"
echo "██╔══██╗██╔════╝██╔══██╗██╔══██╗░░░░░░██╔══██╗██╔════╝"
echo "██████╦╝█████╗░░███████║██████╔╝█████╗██║░░██║╚█████╗░"
echo "██╔══██╗██╔══╝░░██╔══██║██╔══██╗╚════╝██║░░██║░╚═══██╗"
echo "██████╦╝███████╗██║░░██║██║░░██║░░░░░░╚█████╔╝██████╔╝"
echo "╚═════╝░╚══════╝╚═╝░░╚═╝╚═╝░░╚═╝░░░░░░░╚════╝░╚═════╝░"

echo ""
echo "Добро пожаловать в деинсталлятор Bear-OS!"
echo ""

echo "Вы действительно хотите УДАЛИТЬ Bear-OS? (y/N)"
read -r answer

if [[ "$answer" == "y" || "$answer" == "Y" ]]; then
    echo -e "${YELLOW}Удаление Bear-OS...${NC}"

    rm -rf Bear-OS

    echo -e "${GREEN}Готово!${NC}"

    echo ""
    echo "Нажмите Enter, чтобы выйти..."
    read -r
    echo "До свидания!"

else
    echo -e "${RED}Отменено!${NC}"
    exit 1
fi
